#pragma once

#include <Arduino.h>
#include <ESP8266WebServer.h>

extern const char PAGE_HEAD[];
extern const char PAGE_FOOT[];

// ============================================================
//  ИНИЦИАЛИЗАЦИЯ
// ============================================================
// Запуск HTTP-сервера на порту 80.
// Вызывать в setup() после wifiMgr_init() и mqttMgr_init().
void web_init();

// ============================================================
//  ТИКЕР
// ============================================================
// Обработка HTTP-запросов. Вызывать из loop() часто.
void web_tick();

void web_initOta();